node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 120
          }
          dim {
            size: 10
          }
        }
        tensor_content: "\000\000\250A\000\000\000\000\000\000`B\000\000@A\000\000\000\000\000\000@@\000\000\000\000\000\000@A\000\000\202B\000\000\310A\000\000@A\000\000\240@\000\000$B\000\000\300@\000\0000A\000\000\250B\000\000@A\000\000\000\000\000\000\220A\000\000@@\000\000$B\000\000\000\000\000\000\340A\000\000\300@\000\0000A\000\000\220A\000\000pA\000\000\376B\000\000\\B\000\000\340B\000\000\000@\000\000\000\000\000\000\024B\000\000\000\000\000\000\014C\000\000\220A\000\000\300@\000\000\200?\000\000`B\000\000\000\000\000\0000A\000\000\300@\000\000\370A\000\000\340@\000\000\340@\000\000\240@\000\000(B\000\000\270A\000\000\306B\000\000\310A\000\000\240@\000\000\240A\000\000\\B\000\000\230B\000\000\240A\000\000\000\000\000\000\200@\000\000\210A\000\000\240A\000\000\200@\000\000\000\000\000\000\200A\000\000\300A\000\000\370A\000\000\000A\000\000\240@\000\000\270A\000\000\020A\000\0000A\000\000 A\000\000@A\000\000`A\000\000\260A\000\000\200A\000\000\024B\000\000\250A\000\000\200@\000\000\240@\000\000pA\000\000\020A\000\000\000A\000\000\240A\000\000\340@\000\000`A\000\000\200?\000\000\340@\000\000\240@\000\000`A\000\000\300@\000\000\240A\000\000\300@\000\000\210A\000\000\270A\000\000\300@\000\000 A\000\000\250A\000\000\230A\000\000hB\000\000\240@\000\000\200@\000\0004B\000\000\200?\000\000\226B\000\000@B\000\000@@\000\000\310A\000\000\000A\000\000\240@\000\000\000\000\000\000@@\000\000\240@\000\000\320A\000\000\220C\000\000\300@\000\000\000@\000\000@A\000\000 A\000\000\200A\000\000\034B\000\000<B\000\000\240@\000\000\300@\000\000\230A\000\000@A\000\000\016C\000\0000A\000\000\310A\000\000\220A\000\000\340@\000\000\200A\000\000\034B\000\000\270A\000\000\014B\000\000@@\000\000\230A\000\000\200A\000\000 A\000\000\214B\000\000\000A\000\000\340@\000\000\020A\000\000\004B\000\000\000\000\000\000@@\000\000\024B\000\000\010B\000\000\014B\000\000\230A\000\000\000\000\000\000pA\000\000\000\000\000\000\300@\000\000LB\000\000\014B\000\000\370A\000\000\200?\000\000\204B\000\000\300@\000\000\240A\000\000\300@\000\000\200?\000\000\000A\000\000\020A\000\000\340@\000\000\314B\000\000\240@\000\000 A\000\000\000@\000\000\220A\000\000\300@\000\000\000\000\000\0008B\000\000\200@\000\000\360A\000\000PA\000\000\020A\000\000lB\000\000\000A\000\000PA\000\000\000\000\000\000\200?\000\200\203C\000\000@@\000\000\200?\000\0000A\000\000\020A\000\000\200?\000\000\014B\000\000\240A\000\000\300@\000\000\200B\000\000\340@\000\000\000@\000\000\340@\000\000\000@\000\000\020A\000\000@A\000\000 A\000\000 B\000\000@A\000\000\260A\000\000\210A\000\000\350B\000\000dB\000\000\270A\000\000\240@\000\000@@\000\000\200A\000\000\240@\000\000\250A\000\000PA\000\000\320A\000\000PA\000\000\250A\000\000pA\000\000PA\000\000\340@\000\000DB\000\000@@\000\000\310A\000\000\360A\000\000\340A\000\0000A\000\000`A\000\000\250A\000\000@@\000\000\300@\000\000\000A\000\0000A\000\0000A\000\000\240@\000\000@A\000\000PA\000\000\220A\000\000PA\000\000\001C\000\000\340@\000\000\310A\000\000PA\000\000\260A\000\000\000\000\000\000\300@\000\000\200@\000\000\000B\000\000PA\000\000\210A\000\000\020A\000\0000A\000\000 A\000\000\000\000\000\000\000\000\000\000DB\000\000\350A\000\000\300@\000\000\246B\000\0005C\000\000\024B\000\000PA\000\000 A\000\000\200@\000\000\200?\000\000\020A\000\000\240@\000\000\000\000\000\000\300@\000\000\300@\000\000\200@\000\000PA\000\000\000@\000\000@@\000\000\340A\000\000\300A\000\000\000@\000\000\240@\000\000\300@\000\000\014B\000\000lB\000\000\030B\000\000\000@\000\000\020B\000\000\020B\000\000\240@\000\000\000\000\000\000\240@\000\000\220A\000\000\000@\000\000\000A\000\000\376B\000\000\300@\000\000`B\000\000\000A\000\000\010B\000\000\000@\000\000\000@\000\000\200@\000\000\000\000\000\000\000A\000\000\242B\000\000\340@\000\000\240@\000\000\000A\000\000\210A\000\000\300@\000\000\300@\000\000\200A\000\000\240@\000\000\000@\000\000\226B\000\000\340A\000\200\263C\000\000\010B\000\000 A\000\000 A\000\000\240A\000\000\340@\000\000\000\000\000\000\200?\000\000`B\000\000\230A\000\000\340@\000\000\340A\000\000\000A\000\000\240@\000\000\210A\000\000\330A\000\000\250A\000\000\320A\000\000\200@\000\000@@\000\000\020A\000\000\210A\000\000(B\000\000\024B\000\000\270A\000\000\200?\000\000\240@\000\000\020A\000\000\200@\000\000\300@\000\000\210A\000\000\300@\000\000\300@\000\000\210A\000\0004B\000\000\250A\000\000\000@\000\000\000\000\000\000 B\000\000\000\000\000\000\020A\000\000\000@\000\000\010B\000\000@A\000\000\310A\000\000\200@\000\000\000@\000\000\340@\000\000`B\000\000\350A\000\000\227C\000\000@@\000\000\200A\000\000(B\000\000\200@\000\0000A\000\000@@\000\000\360A\000\000\300@\000\000\200?\000\000\200A\000\000\340@\000\000\356B\000\000\020A\000\000\300A\000\0000A\000\000\000\000\000\000tB\000\000\340@\000\000\020A\000\000\300@\000\000\000@\000\000\200@\000\000\200?\000\000\000A\000\000\300@\000\000JC\000\000\020B\000\000PA\000\000\014C\000\000\030B\000\000\\B\000\000 A\000\000\014B\000\0000A\000\000\000@\000\000@@\000\000`B\000\000HB\000\000\004B\000\000\000@\000\000\000\000\000\0008B\000\000`A\000\000pA\000\000\202B\000\000@@\000\000\324B\000\000)C\000\000\300@\000\000\000\000\000\000\020A\000\000\340@\000\000tB\000\000 A\000\000\300@\000\000HB\000\000\210A\000\000\000\000\000\000\360A\000\000\000\000\000\000`A\000\000\000\000\000\000\200?\000\000\340@\000\000\320A\000\000@@\000\000\360A\000\000\004B\000\000@@\000\000\300@\000\000\250A\000\0000B\000\000\004B\000\000\340@\000\000\210A\000\000\360A\000\000@@\000\000\200@\000\000\000\000\000\000@@\000\000\000A\000\200\260C\000\000\340B\000\000\240B\000\000PA\000\0000A\000\000\020A\000\000\340@\000\000\030B\000\000@A\000\000\260A\000\000PA\000\000\300@\000\000\370A\000\200\246C\000\000\350A\000\000\004B\000\000\034B\000\000*C\000\000@@\000\000 A\000\000PA\000\000\240@\000\000\200@\000\000`A\000\000\320A\000\000\000A\000\000\200?\000\000\230A\000\000\240@\000\000\240@\000\000\000@\000\000\200A\000\000\320A\000\000\000@\000\000pA\000\000\014B\000\000\300@\000\000\000A\000\000@@\000\000\300A\000\000\000\000\000\000 B\000\000\200?\000\000\000\000\000\000PA\000\000\240A\000\000\025C\000\000pA\000\000\230A\000\000\200?\000\000\240@\000\000 A\000\000\240A\000\000PA\000\000\240A\000\000\320A\000\000\310A\000\000\024B\000\000@@\000\000\240@\000\000\350A\000\000\240@\000\000\200?\000\000\200A\000\000\000@\000\000\340@\000\000\312B\000\000\340@\000\000\270A\000\000\260A\000\000\260A\000\000pA\000\000\030B\000\000\000@\000\000\340A\000\000`A\000\000\220A\000\0000B\000\000\262B\000\000\220A\000\000\000@\000\000\000@\000\000\000\000\000\000pB\000\000\264B\000\000\000\000\000\000 A\000\000\200?\000\000\020A\000\000\200A\000\000\340A\000\000\000@\000\000\270A\000\000\240@\000\000\010B\000\000@@\000\000 A\000\000\230A\000\000`A\000\000@@\000\000 A\000\000pB\000\000\200B\000\000\270B\000\000\000A\000\000\360A\000\000\300@\000\000\200B\000\000 A\000\000\270A\000\000\220B\000\000\000@\000\000\000B\000\000\320A\000\000\270A\000\000\350B\000\000\200A\000\000\004B\000\0000A\000\000@A\000\000@@\000\000\000\000\000\000\210A\000\000\000A\000\000\340@\000\000\020A\000\000\000\000\000\000\000\000\000\000HB\000\000@@\000\000@A\000\000\220A\000\0000A\000\000 B\000\000\000\000\000\000@@\000\000\000\000\000\000@A\000\000\310A\000\000HB\000\000(B\000\000\210A\000\000`A\000\000pB\000\000\200A\000\000\330A\000\000\000\000\000\000@A\000\000\314B\000\000\330A\000\000\200@\000\000\310A\000\000\216B\000\000\200A\000\000\340@\000\000\020A\000\000\004B\000\000\252B\000\000\226B\000\000\250A\000\000\340A\000\000\240@\000\000@@\000\000\340@\000\000\000@\000\000\000\000\000\000\330A\000\000\200A\000\000\200@\000\000\200A\000\000\200?\000\000\210B\000\000\260A\000\000$B\000\000\200@\000\000\010B\000\000PA\000\000\250A\000\000\020A\000\000\200?\000\000\001C\000\000\200?\000\000\300A\000\000\204B\000\000PA\000\000`B\000\000\370A\000\000\350A\000\000\004B\000\000@A\000\000\000@\000\000\210C\000\000 A\000\000 B\000\000@@\000\000\210A\000\000\214B\000\000\320A\000\000\340B\000\000\000@\000\000\330A\000\000\\B\000\000\340@\000\000\220A\000\000\000\000\000\000\000\000\000\000\000@\000\000\220A\000\000\240A\000\000`A\000\000@A\000\000\000A\000\000\260A\000\000\330A\000\000\260A\000\000\000\000\000\000\000@\000\000\244B\000\000\270B\000\0000A\000\000 A\000\000pA\000\000\340@\000\000\210A\000\000\240@\000\000\266C\000\000\010B\000\000@@\000\000@@\000\000PA\000\000\320A\000\000\020A\000\000\300@\000\000\360A\000\000\300@\000\000\300@\000\000\240A\000\000\200?\000\000\020B\000\000\224B\000\000<B\000\000\310A\000\000 A\000\000\200@\000\000\340@\000\000\200?\000\000`A\000\000\000@\000\000\014B\000\000\020A\000\000\240@\000\000\220A\000\000\000@\000\000\320A\000\000\350A\000\0000A\000\000(B\000\000\000A\000\000\330A\000\000`A\000\000\370A\000\000\340@\000\000\340@\000\000@@\000\000DB\000\000\340B\000\000\350A\000\000\000\000\000\000\240@\000\000\300@\000\000\200?\000\000\000\000\000\000\000\000\000\000\266B\000\000`A\000\000\200?\000\000\340@\000\000\240@\000\000\240@\000\000@B\000\000\340@\000\000\270A\000\000\000A\000\000\210A\000\000\240@\000\0000A\000\000\210A\000\000\270A\000\000\220B\000\000\210A\000\000\240@\000\000\024B\000\000\330A\000\000\340@\000\000\000@\000\000\300@\000\000DB\000\000\200A\000\000\000@\000\000\000\000\000\000\240@\000\000\300@\000\000\000B\000\000\270A\000\000\000A\000\000\024B\000\000@@\000\000\034B\000\000\200@\000\000\240@\000\000\020A\000\000\000\000\000\0008B\000\000\000@\000\000`B\000\000\360A\000\0008B\000\000\210B\000\000\320A\000\000\000@\000\000\222B\000\0000B\000\000`A\000\000\270A\000\000\220A\000\000\340@\000\000\000@\000\000\026C\000\000\300@\000\000\020A\000\000\200@\000\000@@\000\000`A\000\000\370A\000\000\200@\000\000\240@\000\000\300@\000\000\000A\000\000\010B\000\000\310A\000\000\340@\000\000\300@\000\000\020A\000\000\300@\000\000@A\000\000\360A\000\000\370A\000\000\270A\000\000\220B\000\000\200?\000\000\220A\000\000\240@\000\000\000@\000\000\200@\000\000\000A\000\0008B\000\000PA\000\000\024B\000\000\240@\000\000\200?\000\000\340@\000\000\340@\000\000\200@\000\000<B\000\0000A\000\000\300A\000\000\010B\000\000\024B\000\000\200@\000\000\000A\000\000\340@\000\000\000A\000\000\346B\000\000\004B\000\000\240@\000\000<B\000\000\232B\000\000`A\000\000\000\000\000\000\315C\000\000\240@\000\000\320A\000\000\240@\000\000\240@\000\000\240@\000\000\214B\000\000\000\000\000\000@A\000\000pA\000\000\000B\000\000TB\000\000\200?\000\000\340@\000\000\200@\000\000\200A\000\000\004B\000\000\200?\000\000@@\000\000\200?\000\000\240@\000\000xB\000\000\340@\000\000\220A\000\000\000A\000\000\350A\000\000`A\000\000@@\000\000\230A\000\000\340@\000\000 B\000\000\300@\000\000\240@\000\000\000\000\000\000\200B\000\000\210A\000\000\210A\000\000\200@\000\0000A\000\000\216B\000\000@@\000\000\030B\000\000\300@\000\000\340@\000\000\000\000\000\000@A\000\000\350A\000\000\250A\000\000\200?\000\000\000\000\000\000\200@\000\000\222B\000\000pA\000\000\000A\000\000\300@\000\000\240@\000\000XB\000\000 A\000\000`A\000\000\240A\000\000\230A\000\000\000\000\000\000\220A\000\000\000\000\000\000\350A\000\000\200A\000\0000A\000\000@A\000\000\000\000\000\000PA\000\000\000A\000\000\340@\000\000xB\000\000\220A\000\000\020A\000\000\003C\000\000\004B\000\000\200@\000\000@@\000\000 A\000\000@@\000\000\000\000\000\000\000@\000\000\000@\000\000\000A\000\000\226B\000\000`A\000\000PA\000\000 A\000\000@@\000\000\330A\000\000\240@\000\000\210A\000\000\200?\000\000\000\000\000\000\200?\000\000\310A\000\000\260A\000\000\350A\000\000@@\000\000\300@\000\0000A\000\000\330A\000\000PA\000\000,B\000\000\000\000\000\000TB\000\000,B\000\000\\C\000\000\000\000\000\000\310A\000\000\230A\000\000\200@\000\000\000\000\000\000pA\000\000\000@\000\0000A\000\000pA\000\000 A\000\000\340A\000\000\000\000\000\000\230B\000\000\000@\000\000\020A\000\000\360A\000\000\\B\000\000\260A\000\000\220A\000\000\000A\000\000\222B\000\000\220A\000\0000A\000\000\340A\000\000,B\000\000\200A\000\000\230A\000\000\014B\000\000\230B\000\000\370A\000\000pB\000\000@@\000\000\010B\000\000\034B\000\000\020B\000\000\250A\000\000\340@\000\000\325C\000\000\200@\000\000<B\000\000@@\000\000\000@\000\000\240@\000\000\230A\000\000\350A\000\000\200?\000\000\370A\000\000?C\000\000\200@\000\000\220A\000\000\340@\000\000\210A\000\000`A\000\000\262B\000\000TB\000\000\020A\000\000\000\000\000\000\024B\000\000\340@\000\0000A\000\000\020A\000\000pA\000\000@@\000\000\300@\000\000\300@\000\000\300A\000\000\240@\000\000\200?\000\000@@\000\000\000@\000\000\360A\000\000\000A\000\000\250A\000\200\276C\000\000\000\000\000\000\200?\000\000xB\000\000\004B\000\000\370A\000\000\320A\000\000 A\000\000\300@\000\000\240A\000\000\250A\000\000\360A\000\000\220A\000\000\270A\000\000\210A\000\000LB\000\000@@\000\000\000@\000\000@B\000\000 A\000\000PB\000\000\020A\000\000\000@\000\000\240@\000\000@@\000\000\300@\000\000\000A\000\000\000\000\000\000,B\000\000\200@\000\000\250A\000\000\000@\000\000\000A\000\000\014B\000\000\200@\000\000\250A\000\000\202B\000\000`A\000\000\370A\000\000PA\000\000\000@\000\000\000\000\000\000\300@\000\000\270A\000\000\000@\000\000\262B\000\000\230A\000\000\200@\000\000\270A\000\000\200@\000\000\000@\000\000\202B\000\0000A\000\000@@\000\000\000A\000\000\020B\000\000@B\000\000\\B\000\000\000\000\000\000\340@\000\000\210A\000\000\\B\000\000\300@\000\000\000\000\000\000PB\000\000@@\000\000\200@\000\000\020A\000\000\000A\000\000\020A\000\000 A\000\000\234B\000\000\340@\000\000\220A\000\0000A\000\000\000\000\000\000\250A\000\000\000@\000\000PA\000\000\210A\000\000 A\000\000\250A\000\000XB\000\000\206B\000\000PA\000\000@@\000\000 B\000\000@@\000\000tB\000\000(B\000\000\210A\000\000\260A\000\000`A\000\000<B\000\000\004B\000\000@A\000\000@@\000\000\000\000\000\000\004B\000\000PA\000\000\300@\000\000\200A\000\000\000@\000\000\200@\000\000\200A\000\000\320A\000\000\210A\000\000`A\000\000\324B\000\000\020A\000\000\360A\000\000\000\000\000\000@@\000\000\246B\000\000\200@\000\000 A\000\000\000\000\000\000\300@\000\000\240@\000\000\200?\000\000\000\000\000\000\200@\000\0000A\000\000\300A\000\000\rC\000\000\200?\000\000\007C\000\000\320A\000\000tB\000\000\252B\000\000\000\000\000\000\200C\000\000\200?\000\000PA\000\000\230A\000\000pA\000\000\200?\000\000`A\000\000 A\000\000@@\000\0000A\000\000PB\000\000\360A\000\0000A\000\000\210A\000\000\200@\000\000\000\000\000\000TB\000\000\244B\000\000\216B\000\000\000\000\000\000PA\000\000\340@\000\000\340@\000\0000A\000\000\032C\000\000`A\000\0000A\000\000`A\000\000\200@\000\000\340A\000\000\020A\000\000\240@\000\000lB\000\000\210B\000\000\020A\000\000\300@\000\000\374B\000\000\240@\000\000\300@\000\000\024B\000\000\220A\000\000\206B\000\000\240A\000\000\000\000\000\000\340A\000\000\240@\000\000\210B\000\000`A\000\000\020A\000\000\200A\000\000@A\000\000\214B\000\000\360A\000\000\010B\000\000\300@\000\000\200?\000\000\226B\000\000\000@\000\000\216B\000\000\300A\000\000\260A\000\000\014B\000\0000A\000\000@@\000\000\300@\000\000\240A\000\000 A"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 120
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 120
          }
          dim {
            size: 10
          }
        }
        tensor_content: "\000\000\010B\000\000\000\000\000\000pB\000\000\230A\000\000\200?\000\000\200?\000\000\000\000\000\000pA\000\000\224B\000\000\370A\000\000@A\000\000\240@\000\000LB\000\000\000@\000\000\200A\000\000\252B\000\000PA\000\000\000\000\000\000 A\000\000\240@\000\000HB\000\000\000\000\000\000\024B\000\000\300@\000\000\240A\000\000PA\000\000\360A\000\000\026C\000\000TB\000\000\244B\000\000\340@\000\000\200?\000\000\210A\000\000\000\000\000\000\350B\000\000\260A\000\000\240@\000\000\200?\000\0008B\000\000\000\000\000\000\340@\000\000@@\000\000\310A\000\000@A\000\000\200@\000\000 A\000\000\340A\000\000\340A\000\000XB\000\000\210A\000\000\000A\000\000\020A\000\000\\B\000\000\270B\000\000\020A\000\000 A\000\000\200?\000\000\240A\000\000\310A\000\000@@\000\000\000\000\000\000\270A\000\000\330A\000\000\030B\000\000\230A\000\000\000@\000\000\200A\000\000@@\000\000\230A\000\000PA\000\000\220A\000\000\210A\000\000\220A\000\000 A\000\000\330A\000\000\360A\000\000pA\000\000\020A\000\000@A\000\000pA\000\000\300@\000\000PA\000\000\200?\000\000PA\000\000\000A\000\000\340@\000\000\000@\000\0000A\000\000@@\000\000`A\000\000@@\000\000\210A\000\000\220A\000\000\200@\000\000pA\000\000\320A\000\000\000A\000\000\320A\000\0000A\000\000\200@\000\000\010B\000\000\000@\000\000\246B\000\0000B\000\000\000@\000\000 B\000\000\000A\000\000\000A\000\000\200?\000\000\240@\000\000\200@\000\000\014B\000\000]C\000\000\300@\000\000\340@\000\000\020A\000\000\240@\000\000pA\000\000\034B\000\000@B\000\0000A\000\000@A\000\0000A\000\000\240A\000\000\001C\000\000\220A\000\000\010B\000\000\250A\000\000\020A\000\000\200A\000\000\010B\000\000\240A\000\000\200A\000\000\340@\000\000\300A\000\000@A\000\000`A\000\000\340B\000\000\300@\000\000\300@\000\000\210A\000\000\350A\000\000\000\000\000\000@@\000\000\030B\000\000\310A\000\000\004B\000\000 A\000\000\000\000\000\0000A\000\000\000\000\000\000\300@\000\000lB\000\000\020B\000\000\000B\000\000 A\000\000\200B\000\000\240@\000\000`A\000\000\000A\000\000\200@\000\000\340@\000\000\300@\000\000\020A\000\000\000C\000\000\200@\000\000\240@\000\000\000\000\000\000\270A\000\000\300@\000\000\000\000\000\000tB\000\000\300@\000\000\020B\000\000\000A\000\000@@\000\000`B\000\000\220A\000\000\330A\000\000\000@\000\000@@\000\000\\C\000\000\340@\000\000\200?\000\000\020A\000\000\240@\000\000 A\000\0008B\000\000\250A\000\000\340@\000\000\\B\000\000\200@\000\000PA\000\000\210A\000\000\200?\000\000\210A\000\0000A\000\000@@\000\000\310A\000\000\230A\000\000\000A\000\000\220A\000\000\000B\000\0000B\000\000PA\000\000\300@\000\000\200?\000\000\270A\000\000\240@\000\000@B\000\000 A\000\000\000A\000\000\000A\000\000`A\000\000 A\000\000\220A\000\000\350A\000\000HB\000\000\240@\000\000 B\000\000\260A\000\000\270A\000\000@@\000\000\220A\000\000\370A\000\000\200?\000\000 A\000\000\300@\000\000\020A\000\000\030B\000\000@A\000\000\250A\000\000\210A\000\000PA\000\0000A\000\000)C\000\000\200@\000\000\200A\000\000\000@\000\000\004B\000\000\000\000\000\0000A\000\000\020A\000\000\014B\000\000\020A\000\000\240A\000\000@A\000\000\340@\000\000\240@\000\000\000\000\000\000\000\000\000\000\204B\000\000\370A\000\000\000@\000\000\244B\000\000\306B\000\000\320A\000\000\020A\000\000@@\000\000@@\000\000\000\000\000\000`A\000\000\240@\000\000\000\000\000\000\300@\000\000\240@\000\000\020A\000\000\250A\000\000\000@\000\000\240@\000\000\320A\000\000\360A\000\000\000\000\000\000\200@\000\000\300@\000\000$B\000\000 B\000\000\350A\000\000\300@\000\000\034B\000\000,B\000\000\000@\000\000\000\000\000\000\340@\000\000\000A\000\000\200@\000\000@@\000\000\001C\000\000\000@\000\000tB\000\000\340@\000\000\004B\000\000\200@\000\000\200@\000\000\200A\000\000@@\000\000\000@\000\000\320B\000\000`A\000\000\020A\000\000\240@\000\000\210A\000\000\240@\000\000\340@\000\000\220A\000\000\200@\000\000\200?\000\000|B\000\000\220A\000\000\220C\000\000|B\000\000\300@\000\000\340@\000\000\000A\000\000\340@\000\000\000\000\000\000\000\000\000\000\232B\000\000\240A\000\000`A\000\000\320A\000\000\240@\000\000\000A\000\000\210A\000\000\030B\000\000\200A\000\000\014B\000\000 A\000\000\200?\000\000@@\000\000\200A\000\000\370A\000\000\004B\000\000\310A\000\000\000\000\000\000\300@\000\0000A\000\000\000\000\000\000\240@\000\000@A\000\000 A\000\000@@\000\000`A\000\000`B\000\000\300@\000\000@@\000\000\000@\000\000\370A\000\000\000\000\000\000\240@\000\000\200@\000\000\370A\000\000\250A\000\000\270A\000\000\020A\000\000@@\000\000\200A\000\000TB\000\000\014B\000\200\305C\000\000@@\000\000@A\000\000\020B\000\000\000@\000\0000A\000\000\200@\000\000\360A\000\000\210A\000\000\300@\000\000PA\000\000\000A\000\000\tC\000\000\000A\000\000\340A\000\000\300@\000\000\000\000\000\000(B\000\000\230A\000\000\260A\000\000\240@\000\000\340@\000\000\000A\000\000\200?\000\000\020A\000\000\200@\000\000\210C\000\000\014B\000\000\220A\000\000\014C\000\000\360A\000\000\000B\000\000\020A\000\000\260A\000\000\240A\000\000\200@\000\000\240@\000\000\226B\000\000(B\000\000\014B\000\000\000@\000\000\000\000\000\000,B\000\000`A\000\000\000A\000\000\\B\000\000\200@\000\000\312B\000\000\rC\000\000\300@\000\000\200?\000\000\240@\000\000\300@\000\000TB\000\000\240@\000\000@@\000\000`B\000\0000A\000\000\000\000\000\000\000B\000\000\000\000\000\000pA\000\000\000\000\000\000\000@\000\000\340@\000\000\250A\000\000@@\000\000\240A\000\000\030B\000\000\000@\000\000\300@\000\000\320A\000\000\310A\000\000\004B\000\000\240A\000\000 A\000\000\270A\000\000\340@\000\000\240@\000\000\000\000\000\000@@\000\000\240@\000\000\315C\000\000\324B\000\000\250B\000\000 A\000\000`A\000\000\000@\000\000\340@\000\000\014B\000\000`A\000\000pA\000\000`A\000\000\000@\000\000\320A\000\200\260C\000\000\030B\000\000\220A\000\000\240A\000\000\007C\000\000\000@\000\000\000A\000\000 A\000\000\000\000\000\0000A\000\000`A\000\000<B\000\000\310A\000\000\200?\000\000\210A\000\000\000@\000\000\200@\000\000\200@\000\000\000A\000\000\010B\000\000\000\000\000\000\240A\000\000\004B\000\000PA\000\000\020A\000\000\200?\000\000\350A\000\000\000\000\000\0000B\000\000\000\000\000\000\000@\000\000 A\000\000 B\000\000\340B\000\000\270A\000\000@A\000\000\000@\000\000@@\000\000PA\000\000@A\000\000\020A\000\000\200A\000\000\004B\000\000\270A\000\000\350A\000\000\300@\000\000\240@\000\000\360A\000\0000A\000\000\000\000\000\0000A\000\000@@\000\000\020A\000\000*C\000\000 A\000\000\020A\000\000PA\000\000\330A\000\000\200@\000\000DB\000\000@@\000\000\020B\000\000@A\000\000\200A\000\000LB\000\000\346B\000\000\300@\000\000\300@\000\000\000\000\000\000\200?\000\000\230B\000\000\252B\000\000\000\000\000\000\250A\000\000@@\000\000`A\000\000\240@\000\000\034B\000\000@@\000\000`A\000\000\000A\000\000\370A\000\000@@\000\000\210A\000\000\310A\000\000\210A\000\000\000@\000\000\020A\000\0004B\000\000`B\000\000\014C\000\000@@\000\000\020B\000\000\340@\000\000\210B\000\000PA\000\000\270A\000\000\226B\000\000\240@\000\0008B\000\000\000B\000\000\210A\000\000\016C\000\000\200A\000\000 B\000\000\200@\000\000\240@\000\000\240@\000\000\000\000\000\000\300A\000\000\240@\000\000\300@\000\000\220A\000\000\000\000\000\000\000\000\000\000\010B\000\000@@\000\000\200A\000\000\000A\000\000\000@\000\000\340A\000\000\200?\000\000@@\000\000\000@\000\000\210A\000\000\014B\000\000\014B\000\000\024B\000\000\210A\000\000 A\000\000pB\000\000\200A\000\000@A\000\000\000\000\000\000\200A\000\000\376B\000\000\220A\000\000\300@\000\0004B\000\000\314B\000\000\020A\000\000\300@\000\000\300@\000\000\300A\000\000\206B\000\000\230B\000\000\340A\000\000\320A\000\000\300@\000\000\020A\000\000 A\000\000@@\000\000\000\000\000\000\300A\000\0000A\000\000\300@\000\000\240A\000\000\000@\000\000lB\000\000\210A\000\000\010B\000\000\000@\000\000<B\000\000\210A\000\000 A\000\000@A\000\000@@\000\000\014C\000\000\000A\000\000\320A\000\000`B\000\000\200A\000\000\214B\000\000\010B\000\000\210A\000\000\360A\000\000@A\000\000\200@\000\000\227C\000\000\340A\000\000\330A\000\000@A\000\000\340@\000\000<B\000\000\210A\000\000\032C\000\000\200?\000\000\250A\000\000XB\000\000@A\000\000\220A\000\000\000\000\000\000@@\000\000@@\000\000\020A\000\000\230A\000\000pA\000\000 A\000\000\250A\000\000\200A\000\000\014B\000\000\024B\000\000\000\000\000\000\200?\000\000\374B\000\000\216B\000\000\340@\000\000\260A\000\000`A\000\0000A\000\000\310A\000\000\340@\000\200\263C\000\000\360A\000\000\200@\000\000@@\000\0000A\000\000pA\000\000\240@\000\000\200@\000\000PB\000\000\340@\000\000\340@\000\000\300A\000\000@@\000\000\370A\000\000\214B\000\000HB\000\000xB\000\000\200A\000\000\200?\000\000\200@\000\000\200@\000\000\300@\000\000\000@\000\000\310A\000\000\210A\000\000\300@\000\000\270A\000\000@@\000\000\360A\000\000\360A\000\000@@\000\000DB\000\000\340@\000\000\360A\000\000\340@\000\000\340A\000\000@@\000\000 A\000\000\340@\000\000\\B\000\000\214B\000\000\310A\000\000\000\000\000\0000A\000\000\000@\000\000\240@\000\000\300@\000\000\000\000\000\000\220B\000\0000A\000\000\000@\000\000\340@\000\000@@\000\000\240@\000\000DB\000\000\300@\000\000\300A\000\000PA\000\000\000A\000\000\300@\000\000\240@\000\000\000A\000\000\200A\000\000<B\000\000\300A\000\000\020A\000\000\024B\000\000(B\000\000\020A\000\000\200@\000\000\300@\000\000(B\000\000\220A\000\000\000@\000\000\000\000\000\000\000@\000\000\340@\000\000\320A\000\000PA\000\000\340@\000\000,B\000\000\200?\000\000\034B\000\000\200?\000\000\240@\000\000@@\000\000\000\000\000\000\370A\000\000@@\000\000\226B\000\000\024B\000\000@B\000\000DB\000\000\350A\000\000PA\000\000\210B\000\000\010B\000\000\340@\000\000@A\000\000\310A\000\000\000\000\000\000@@\000\000?C\000\000\000A\000\000\270A\000\000\200@\000\000\200?\000\000\020A\000\000\004B\000\000\000\000\000\000\200?\000\000@@\000\000\250A\000\000 B\000\000\250A\000\000\200@\000\000\000A\000\000\020A\000\000PA\000\000PA\000\000\340A\000\000\010B\000\000\210A\000\000`B\000\000\000\000\000\000\246B\000\000@@\000\000@@\000\000@@\000\000\000A\000\000\024B\000\000PA\000\000dB\000\0000A\000\000\300@\000\000\340@\000\0000A\000\000@@\000\000pB\000\000\240@\000\000\340A\000\000\270A\000\000$B\000\000\020A\000\000\020A\000\000`A\000\000@@\000\0003C\000\000\360A\000\000\340@\000\000\330A\000\000\226B\000\000\220A\000\000\000\000\000\000\266C\000\000 A\000\000\350A\000\000\200@\000\000\200@\000\000\200A\000\000tB\000\000\200?\000\000\340@\000\000\270A\000\000\320A\000\000\020B\000\000\200?\000\000\020A\000\000\240@\000\000\210A\000\000pA\000\000\000\000\000\000\200?\000\000\000@\000\000\340@\000\000$B\000\000\240@\000\000PA\000\000\300@\000\000\260A\000\000pA\000\000\200@\000\000\220A\000\000\240@\000\000\004B\000\000\000A\000\000\000@\000\000\000\000\000\000\210B\000\000 A\000\000\200A\000\000\240@\000\000\200A\000\000\340B\000\000\000@\000\000\360A\000\000\240@\000\000\000A\000\000\000\000\000\000\260A\000\000\310A\000\000`A\000\000\200@\000\000\200?\000\000\200?\000\000\262B\000\000PA\000\000\200@\000\000\200@\000\000\000@\000\000\240B\000\000@A\000\000`A\000\000\350A\000\000\020A\000\000\000\000\000\000\330A\000\000\000\000\000\000\260A\000\000\340@\000\000\000A\000\000pA\000\000@@\000\000\300@\000\000PA\000\000\020A\000\000\200B\000\000\250A\000\0000A\000\000\340B\000\000\370A\000\000@@\000\000@A\000\000\250A\000\000@@\000\000\200?\000\000 A\000\0000A\000\000\200A\000\000<B\000\000\200A\000\000PA\000\000\220A\000\000@@\000\000PA\000\000\200?\000\000\230A\000\000\200?\000\000\000@\000\000 A\000\000\230A\000\000@A\000\000\320A\000\000\340@\000\000@A\000\000\300@\000\000\250A\000\000pA\000\000\010B\000\000\000@\000\000\202B\000\000\350A\000\000LC\000\000\000@\000\000\220A\000\000\240A\000\000\300@\000\000\000\000\000\000\260A\000\000\000@\000\000\350A\000\000\210A\000\000\000A\000\000`A\000\000\200?\000\000\204B\000\000\000A\000\000\340@\000\000\350A\000\000\240B\000\000PA\000\000\250A\000\000\300@\000\000,B\000\000\020A\000\000\240@\000\000\330A\000\000\\B\000\000\200A\000\000\310A\000\000\024B\000\000tB\000\000\030B\000\000TB\000\0000A\000\000\004B\000\000\310A\000\000\230A\000\000\250A\000\000\340@\000\200\346C\000\000\200@\000\000\320A\000\000\200?\000\000@@\000\000\300@\000\000 A\000\000\370A\000\000\200?\000\000\024B\000\000\200C\000\000\200?\000\000\200A\000\000\240@\000\000pA\000\000\240A\000\000\270B\000\0008B\000\000\240A\000\000\000\000\000\000\240A\000\000\240@\000\0000A\000\000\020A\000\000\020A\000\000\000@\000\000\200?\000\000\260A\000\000\370A\000\000PA\000\000\000\000\000\000\200?\000\000\300@\000\000\034B\000\000\340@\000\000@A\000\200\246C\000\000\000\000\000\000\000\000\000\000pB\000\000,B\000\000\030B\000\000PA\000\000PA\000\000\000A\000\000\320A\000\000\220A\000\000\240A\000\000`A\000\000\210A\000\000\230A\000\000\202B\000\000\200@\000\000\000@\000\000 B\000\000\020A\000\000lB\000\000\300@\000\000\000@\000\000\200?\000\000\000@\000\000\300@\000\000PA\000\000\000\000\000\000\024B\000\000\300@\000\000\210A\000\000\300@\000\0000A\000\000\340A\000\000\000A\000\000\220A\000\000\216B\000\000\220A\000\000\360A\000\000\330A\000\000\300@\000\000\000\000\000\0000A\000\000\350A\000\000\000\000\000\000\210B\000\000\024B\000\000\240@\000\000`A\000\0000A\000\000@@\000\000\004B\000\000\240@\000\000\240@\000\000\240@\000\000@B\000\000`B\000\000\206B\000\000\000\000\000\000@@\000\000\230A\000\000TB\000\000\300@\000\000\000\000\000\000<B\000\000\000\000\000\000\240@\000\000@A\000\000\000@\000\000`A\000\000\240@\000\000\214B\000\000\200?\000\000\330A\000\000@A\000\000\000\000\000\0000A\000\000\300@\000\000\240A\000\000\260A\000\000\240@\000\000\220A\000\000xB\000\000\202B\000\000 A\000\000\200@\000\000\024B\000\000`A\000\000dB\000\000\004B\000\000\230A\000\000\340A\000\000\200@\000\000(B\000\000\310A\000\000PA\000\000\340@\000\000\000\000\000\000PB\000\000 A\000\000@@\000\000`A\000\000\300@\000\000\240@\000\000\260A\000\000\030B\000\000 A\000\000\340@\000\000\210B\000\0000A\000\0004B\000\000\000\000\000\000\000@\000\000\350B\000\000\000\000\000\000\000A\000\000\000\000\000\000\020A\000\000\340@\000\000\000@\000\000\000\000\000\0000A\000\000\200A\000\000\220A\000\000\330B\000\000\000@\000\000\324B\000\000\230A\000\000\206B\000\000\\B\000\000\000\000\000\200\244C\000\000\200?\000\000\000@\000\000\010B\000\000\230A\000\000\000\000\000\000\200A\000\000\250A\000\000\240@\000\000 A\000\000`B\000\000\350A\000\000\270A\000\000\200@\000\000\000@\000\000\000@\000\000\230B\000\000\222B\000\0000B\000\000\000\000\000\000\200@\000\000\340@\000\000\240@\000\000\000A\000\000\266B\000\000 A\000\000`A\000\000pA\000\000\340@\000\000\024B\000\000\240@\000\000\000@\000\000\216B\000\000@B\000\000 A\000\0000A\000\000\356B\000\000\240@\000\000\240@\000\000\350A\000\000pA\000\000\222B\000\000\210A\000\000\000\000\000\000\320A\000\000\340@\000\000\262B\000\000@A\000\000\000@\000\000\220A\000\000\310A\000\000\242B\000\000\360A\000\000\360A\000\000\240@\000\000\000@\000\000\216B\000\000\240@\000\000\226B\000\000\210A\000\000 A\000\000\360A\000\000 A\000\000\240@\000\000`A\000\000\210A\000\000`A"
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 580
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "drop_remainder"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "OneShotIterator"
  op: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dataset_factory"
    value {
      func {
        name: "_make_dataset_yffAtLfeL8Q"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext"
  input: "ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Shape"
  op: "Shape"
  input: "ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice"
  op: "StridedSlice"
  input: "Shape"
  input: "strided_slice/stack"
  input: "strided_slice/stack_1"
  input: "strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "Shape_1"
  op: "Shape"
  input: "ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice_1/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_1"
  op: "StridedSlice"
  input: "Shape_1"
  input: "strided_slice_1/stack"
  input: "strided_slice_1/stack_1"
  input: "strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "DropoutWrapperInit/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DropoutWrapperInit/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DropoutWrapperInit/Const_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.699999988079071
      }
    }
  }
}
node {
  name: "rnn/Rank"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "rnn/range/start"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "rnn/range/delta"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "rnn/range"
  op: "Range"
  input: "rnn/range/start"
  input: "rnn/Rank"
  input: "rnn/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "rnn/concat/values_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "rnn/concat/axis"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
